---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructure.IsVerticallyCompound
source: html/cd352f22-8ca4-b3b6-f247-d9865a91bb6f.htm
---
# Autodesk.Revit.DB.CompoundStructure.IsVerticallyCompound Property

Identifies if this CompoundStructure represents a layout that is more complicated than a simple set of parallel layers.

## Syntax (C#)
```csharp
public bool IsVerticallyCompound { get; }
```

## Remarks
Vertically compound structures should be assigned only to walls.